Pavlo-Rzh/GitTraining/GitTraining_pic18F25K80.c
/*
 * File:   FCU_pic18.c
 * Author: pavel
 *
 * Created on February 11, 2026, 11:14 AM
 */


#include <xc.h>

// CONFIG1L
#pragma config RETEN = OFF      // VREG Sleep Enable bit (Ultra low-power regulator is Disabled (Controlled by REGSLP bit))
#pragma config INTOSCSEL = LOW  // LF-INTOSC Low-power Enable bit (LF-INTOSC in Low-power mode during Sleep)
#pragma config SOSCSEL = DIG    // SOSC Power Selection and mode Configuration bits (Digital (SCLKI) mode)
#pragma config XINST = OFF      // Extended Instruction Set (Disabled)

// CONFIG1H
#pragma config FOSC = EC3       // Oscillator (EC oscillator (High power, 16 MHz - 64 MHz))
#pragma config PLLCFG = OFF     // PLL x4 Enable bit (Disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor (Disabled)
#pragma config IESO = OFF       // Internal External Oscillator Switch Over Mode (Disabled)

// CONFIG2L
#pragma config PWRTEN = ON      // Power Up Timer (Enabled)
#pragma config BOREN = SBORDIS  // Brown Out Detect (Enabled in hardware, SBOREN disabled)
#pragma config BORV = 1         // Brown-out Reset Voltage bits (2.7V)
#pragma config BORPWR = MEDIUM  // BORMV Power level (BORMV set to medium power level)

// CONFIG2H
#pragma config WDTEN = SWDTDIS  // Watchdog Timer (WDT enabled in hardware; SWDTEN bit disabled)
#pragma config WDTPS = 32       // Watchdog Postscaler (1:32)

// CONFIG3H
#pragma config CANMX = PORTB    // ECAN Mux bit (ECAN TX and RX pins are located on RB2 and RB3, respectively)
#pragma config MSSPMSK = MSK5   // MSSP address masking (5 bit address masking mode)
#pragma config MCLRE = ON       // Master Clear Enable (MCLR Enabled, RE3 Disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Overflow Reset (Enabled)
#pragma config BBSIZ = BB1K     // Boot Block Size (1K word Boot Block size)
#pragma config DEBUG = OFF      // Background Debugger (Background Debugger disabled)

// CONFIG5L
#pragma config CP0 = OFF        // Code Protect 00800-01FFF (Disabled)
#pragma config CP1 = OFF        // Code Protect 02000-03FFF (Disabled)
#pragma config CP2 = OFF        // Code Protect 04000-05FFF (Disabled)
#pragma config CP3 = OFF        // Code Protect 06000-07FFF (Disabled)

// CONFIG5H
#pragma config CPB = OFF        // Code Protect Boot (Disabled)
#pragma config CPD = OFF        // Data EE Read Protect (Disabled)

// CONFIG6L
#pragma config WRT0 = OFF       // Table Write Protect 00800-01FFF (Disabled)
#pragma config WRT1 = OFF       // Table Write Protect 02000-03FFF (Disabled)
#pragma config WRT2 = OFF       // Table Write Protect 04000-05FFF (Disabled)
#pragma config WRT3 = OFF       // Table Write Protect 06000-07FFF (Disabled)

// CONFIG6H
#pragma config WRTC = OFF       // Config. Write Protect (Disabled)
#pragma config WRTB = OFF       // Table Write Protect Boot (Disabled)
#pragma config WRTD = OFF       // Data EE Write Protect (Disabled)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protect 00800-01FFF (Disabled)
#pragma config EBTR1 = OFF      // Table Read Protect 02000-03FFF (Disabled)
#pragma config EBTR2 = OFF      // Table Read Protect 04000-05FFF (Disabled)
#pragma config EBTR3 = OFF      // Table Read Protect 06000-07FFF (Disabled)

// CONFIG7H
#pragma config EBTRB = OFF      // Table Read Protect Boot (Disabled)

//=========================

const unsigned short SredPwm=4500;  // PWM 1,5ms  ?? ????????? ??  ?????? ??????? 4500*0.03333 = 1.5 ms
 
unsigned char Vtest=1;//////////////////////////////////////////////
///////////////////
unsigned short Vtest3 = 100500;/////////////////
float QWER1=1.2345f;/////////////////////////
float asdf=6.789f;
unsigned short Vtest4 = 0, Vtest5 = 1, Vtest6 = 100;
signed short Vref7=101;

volatile unsigned char AdcDelay=0, FgReadyUsart=0, FlagStartSendUsart=0, SendTimeUsart=0;
volatile unsigned char	FgBuf=0, UsartWdt=0;
unsigned char MasUsartRead[12], ArrUsartReady[12], SendDataUsart[12];
unsigned short AdcData[5] = {0};//?????? ??????????? ???????? ??? ??? ????????
volatile unsigned short Servo1FgBuf0, Servo2FgBuf0, Servo3FgBuf0, Servo4FgBuf0, Servo5FgBuf0, Servo6FgBuf0;
volatile unsigned short Servo1FgBuf1, Servo2FgBuf1, Servo3FgBuf1, Servo4FgBuf1, Servo5FgBuf1, Servo6FgBuf1;
unsigned char FgTestUsart=0;
union Preob
	{
	 unsigned int Perev;
	 unsigned char P[2];
	} AdcP, ccpu, pr;
//========================
void ReadADC(void)
{
static unsigned char Step=0, CounChan=0, TempCount=0, TempTest=0;
static unsigned char Izmer=0; //?????????? ????? ???
static unsigned int MassivAdc[5]={0}; //?????????? ????? ???
static unsigned char MassivCount[5]={0};

	switch(Step)
	{
		case 0:
		//????? ??????
			TempCount=CounChan<<2;
			TempCount|=0x01;
			ADCON0=TempCount;
			AdcDelay=0;
			Step=1;
			break;
		case 1:
		//????????? ??????? 
			if(AdcDelay>3)
			{
				Step=2; //???????? ?? ????? ??????? ???????????
			}
			break;
		case 2:
			//????????? ??????
			GO_nDONE=1;//????? ??? ??????????????
			Step=3;
			break;
		case 3:
			//while(GO_nDONE) continue;
			if(GO_nDONE==1)
					return;			
			//?????? ?????? => ????????? ??
/*!!!!!
? ?????? ?????????? ??? ???????? ? ???? ??????, ??? ???????? ? ???? ??? ?????? ????? ???? ?????????????. ??? ?????? ?? ???? ?????????? ? ?????? ????,
???????? ???????? ????????????? ???????? (?????? ???????? ????? -2  (????? 2)). ??? ?????????? ??????? ??????? ?????????? ?????? ????????? ???? ?????????? ? 
???? ?? ????????????? ?? ?????????? ????????? ? ????.
?????? ??? ???????? ????????? ????, ??????? ?????????? ???? ??? ?????????????? - ??????? 4 ???? ? ?? ADRESH.

Differential conversion feeds the two input channels to
a unity gain differential amplifier. The positive channel
input is selected using the CHSx bits (ADCON0<6:2>)
and the negative channel input is selected using the
CHSNx bits (ADCON1<2:0>).
The output from the amplifier is fed to the A/D Con-
verter, as shown in  Figure 23-1. The 12-bit result is
available on the ADRESH and ADRESL registers. An
additional bit indicates if the 12-bit result is a positive or
negative value.
*/
			ADIF=0;
			AdcP.P[0]=ADRESL;
			AdcP.P[1]=ADRESH;
			//--???????? ????? ??????????
			if((AdcP.P[1]&0xF0)==0xF0)
			{
			//????????? ?????????????
				AdcP.P[0]=0;
				AdcP.P[1]=0;
			}
			AdcP.P[1]&=0x0F;// ?????? 12 ??? ???
			MassivAdc[CounChan]=MassivAdc[CounChan]+AdcP.Perev;//?????????? ???

			if(++MassivCount[CounChan]>1)
			{
				AdcData[CounChan]=(MassivAdc[CounChan]>>1);//?????????? (??????? ?? 2)
				//--????????????? ??? ?????????? ????? ?????????
				MassivCount[CounChan]=0;
				MassivAdc[CounChan]=0;
			}
			Step=0;
			if(++CounChan>3)
			{
			
				CounChan=0;
			}
			break;

	}
	if(Step>3)
		Step=0;
}
//========================
//?????????? ?????? 1 ??
void LedControl(void)
{
static unsigned short TimeLed=0;

	if(UsartWdt>20)
	{
	//??? ????? ?? USART ? ??????? ??????????? Cortex M4 - ?????????? ?????????? ?????
		if(++TimeLed<500)
			LATB1=0;
		else
		{
		
			LATB1=1;
		}
		if(TimeLed>1200)
			TimeLed=0;
	}
	else
	{
		//????? ????
		if(++TimeLed<150)
			LATB1=0;
		else
		{
		
			LATB1=1;
		}
		if(TimeLed>300)
			TimeLed=0;


	}
}
//========================
unsigned short CalcServoPwm(unsigned char ArrNumb)
{
static unsigned short TempCalc=0;

	pr.P[0]=ArrUsartReady[ArrNumb];
	ArrNumb++;
	pr.P[1]=ArrUsartReady[ArrNumb]&0x03;	
	pr.Perev=pr.Perev*6;
	TempCalc=pr.Perev>>1;
	TempCalc+=2964;	//????????? ???????? 3000-> 1 ?? - ?????. ???????????? ???????? ???
	return(TempCalc);
}
//========================
/*

????????? ????????? ???????? ?? ??? ?? Cortex M4 
?????????????? ???? ? ???. 1...2 ??
????? 1 ?????????? ? 4-? ?????
ArrUsartReady[0] - ????? ??????
ArrUsartReady[1] - 8-?? ??? 10-?? ?????? ???? ??? ????? 1
ArrUsartReady[2] - ??????? 2-? ???? (8-? ? 9-?) 10-?? ?????? ???? ??? ????? 1. ? ??????? ????? ??????????? ?  (??? 0 ? ??? 1)
ArrUsartReady[3] - 8-?? ??? 10-?? ?????? ???? ??? ????? 2
ArrUsartReady[4] - ??????? 2-? ???? (8-? ? 9-?) 10-?? ?????? ???? ??? ????? 2. ? ??????? ????? ??????????? ?  (??? 0 ? ??? 1)
ArrUsartReady[5] - 8-?? ??? 10-?? ?????? ???? ??? ????? 3
ArrUsartReady[6] - ??????? 2-? ???? (8-? ? 9-?) 10-?? ?????? ???? ??? ????? 3. ? ??????? ????? ??????????? ?  (??? 0 ? ??? 1)
ArrUsartReady[7] - 8-?? ??? 10-?? ?????? ???? ??? ????? 4
ArrUsartReady[8] - ??????? 2-? ???? (8-? ? 9-?) 10-?? ?????? ???? ??? ????? 4. ? ??????? ????? ??????????? ?  (??? 0 ? ??? 1)

????? 2 ?????????? ?? ????? ????
ArrUsartReady[0] - ????? ??????
ArrUsartReady[1] - 8-?? ??? 10-?? ?????? ???? ??? ????? 5
ArrUsartReady[2] - ??????? 2-? ???? (8-? ? 9-?) 10-?? ?????? ???? ??? ????? 5. ? ??????? ????? ??????????? ?  (??? 0 ? ??? 1)

*/
void DataToPWM(void)
{
 static unsigned short Servo1=0, Servo2=0, Servo3=0, Servo4=0, Servo5=0, Servo6=0;


	if(FgReadyUsart==0)
			return;

	/*
		????????? ?????? ? ??? ????? - ??? ????
		????????? X ??? 0...1023 ? ????? Y ??? ?????? CCP 0...3000 (??????????????)
		X*6/2=Y (0...1023) -> 0...3069 (0...1022 ms).
		????? 0...3000 - ????????????? 0...1 ??.
		??????? ??????? ????? 0,333333333 ??? (???? ???  ??????? 1)
		

	? ?????? ???????????? ?????????? ????????? ? ???????? 988 ???...2011 ???
	0,988 ??? ????????????? ???????? 2964 (0,988=2964*0,03333333)
	*/
	if(ArrUsartReady[0]==1)
	{
	//??????? ????? 1  - ??? ?????????
		//??????????? ?????????? ???????? ??? ?????????? ????? ?????
		FgBuf=0;
/*
		pr.P[0]=ArrUsartReady[1];
		pr.P[1]=ArrUsartReady[2]&0x03;	
		pr.Perev=pr.Perev*6;
		Servo1=pr.Perev>>1;
		Servo1+=2964;	//????????? ???????? 3000-> 1 ?? - ?????. ???????????? ???????? ???
		Servo1FgBuf0=Servo1;
*/
		Servo1 = CalcServoPwm(1);
		Servo1FgBuf0=Servo1;

		Servo2 = CalcServoPwm(3);
		Servo2FgBuf0=Servo2;

		Servo3 = CalcServoPwm(5);
		Servo3FgBuf0=Servo3;

		Servo4 = CalcServoPwm(7);
		Servo4FgBuf0=Servo4;

		FgBuf=1;
		Servo1FgBuf1=Servo1;
		Servo2FgBuf1=Servo2;
		Servo3FgBuf1=Servo3;
		Servo4FgBuf1=Servo4;		
	}
	if(ArrUsartReady[0]==2)
	{
	//??????? ????? 2  - ??? ?????????
		FgBuf=0;

		Servo5 = CalcServoPwm(1);
		Servo5FgBuf0=Servo5;

		Servo6 = CalcServoPwm(3);
		Servo6FgBuf0=Servo6;

		FgBuf=1;
		Servo5FgBuf1=Servo5;
		Servo6FgBuf1=Servo6;
	}
	
	FgReadyUsart=0; //??????? ?????? ??????????

}
//=========================
/*
?????? ?????? USART
*/
void ReadUsart(void)
{
static unsigned char CounArr=0, StepPrep=0, Temp=0, Buff=0;
static unsigned char Crc=0, Inv=0, k=0;
	Temp=RCSTA1;
	if ((Temp&0x02)==0x02) 
	{ //????????? ???????????? ??????
		Temp=RCREG1;
		RCSTA1=0b10000000;//CREN=0;
		StepPrep=0;
		RCSTA1=0b10010000;
		return;
	}
//	if (RC1IF==0)
//			 return; //?????? ?? ???????
	Buff=RCREG1;
	RC1IF=0;
//	return;
//--?????? ?????????------
	switch(StepPrep)
	{
		case 0:
			if(Buff==0xAA)
			{
				//?????? ?????????
				CounArr=0;
				//Crc=Buff;
				StepPrep=1;
				return;
			}
			break;
		case 1:
				if(Buff==0x55)
				{

					StepPrep=2; //?????? ?? ????? ?????? ? ???????
					Crc=0x55+0xAA;//0x55^0xAA;
					CounArr=0;
	
				}
				else
				{
					
					StepPrep=0;//?????? ?? ????? ?????????
				}				
			break;
		case 2:
				MasUsartRead[CounArr]=Buff;
				if(CounArr<9)
				{
					Crc+=Buff;
				}			
				if(++CounArr>9)
				{
					//??????? 10-?? ???? ??????
					if(Crc==MasUsartRead[9])
					{
					//??????????? ????? ???????, ???????? ?????? ??? ??????
						if(FgReadyUsart==0)
						{
						//?????????? ????? ?????????? ? ???????? ?????
							for (k=0; k<9; k++)
							{
								ArrUsartReady[k]=MasUsartRead[k];
							}
							FgReadyUsart=1;//?????????? ???????? ?????? - ??????? ?????? ?????????
						}
						StepPrep=0;
						UsartWdt=0; //??? ????????? ??????? ????? ?? ??? ?????

						if(FgTestUsart==0)
						{
							FgTestUsart=1;
						}
						else
						{
							FgTestUsart=0;
						}	
						LATB4=FgTestUsart; //??? ?????

					}
					else
					{
					//??????????? ????? ?? ???????
						StepPrep=0;
					}
					CounArr=0;
				}
			break;
	}
	if(StepPrep>2)
			StepPrep=0;
}
//=========================
void PrepareDataSendUsart(void)
{
	if(SendTimeUsart < 10)
				return;
//????? ??? ???????? ????????? (10 ms)
	if(FlagStartSendUsart==1)
				return; //?????????? ???????? ?? ?????????
	SendDataUsart[0]=0xAA;
	SendDataUsart[1]=0x55;
	SendDataUsart[2]=1; //????? ?????? ??? ????????
	SendDataUsart[3]=(unsigned char)(AdcData[0]&0x00FF); //12-?? ??? ?????? ???
	SendDataUsart[4]=(unsigned char)((AdcData[0]>>8)&0x000F);
	SendDataUsart[5]=(unsigned char)(AdcData[1]&0x00FF);
	SendDataUsart[6]=(unsigned char)((AdcData[1]>>8)&0x000F);
	SendDataUsart[7]=(unsigned char)(AdcData[2]&0x00FF);
	SendDataUsart[8]=(unsigned char)((AdcData[2]>>8)&0x000F);
	SendDataUsart[9]=(unsigned char)(AdcData[3]&0x00FF);
	SendDataUsart[10]=(unsigned char)((AdcData[3]>>8)&0x000F);
//	GIE=0;
	FlagStartSendUsart=1;
	SendTimeUsart=0;
//	GIE=1;	
}
//=========================
/*
???????? ????? ?????????? ? ??? ???????

12 ????(0xAA, 0x55, Data0...Data8, Crc)
 Data 0 - ????? ??????
 Data1...Data8 - 8-?? ???? ??????
 Crc - ???? ???? - ????? ????

????????? FlagStartSendUsart==0, ???? ????? ?? ???????? ?????? ??? ???????? ? 
? ???????????  ? 1 FlagStartSendUsart

*/
void SendUsart(void)
{
static unsigned char TempRead=0, CounSend=0, CrcSend=0;

	if(FlagStartSendUsart==0)
					return;
	TempRead=TXSTA1;
	if ((TempRead&0x02)==0)
					return;
	
	//????? ?????? - ????? ??????????
	TXREG1=SendDataUsart[CounSend];
	TXSTA1|=0x20;//????? ????????
	if(CounSend<11)
	{
		//??????? CRC
		CrcSend+=SendDataUsart[CounSend];
		SendDataUsart[11]=CrcSend;
	}
	if(++CounSend>11)
	{
		//?????? ???????? ? ????? ??? ????????
		//?????? SendDataUsart[0]...[11] ?????????. ??? ???? ????????? ???? (???????? ??? ?????) ?????? ?????????? (?????????
		//? ????????? ???????? ??? ????????).
		FlagStartSendUsart=0;
		CrcSend=0;
		CounSend=0;
		return;	
	}	
	
}
//=========================

void Ini(void)
{ //?????????????
	di();//?????????? ???? ??????????
    asm("clrwdt");
    OSCCON&=0xFC;
//???? RCON
	IPEN=1; //???????????? ??????? ??????????
	RI=1;
	POR=1;
	BOR=1;

    PIE1=0x20;// 1 -> ??? 5 = Enables the EUSARTx receive interrupt 
    PIE2=0x00;
    PIE3=0x02;
    PIE4=0x00;
    PIE5=0x00;

    IPR1=0x00;
	IPR2=0;
	IPR3=0x02;	
	IPR4=0;
    IPR5=0;



    INTCON=0x20; //????. ?? ?/? 0
    INTCON2=0;  //????. ???????. ?????????? ?/? 0
    INTCON3=0;
    PIR1=0;
	PIR2=0;
	PIR3=0;
    PIR4=0;
    PIR5=0;
	
	T2CON=0;
	TMR0L=0;
	T0CON=0xC4;

	PORTA=0;
	LATA=0; 
	TRISA=0b10011111;//0b00000110
	
	PORTB=0;	
	LATB=0;
	TRISB=0b11001000;

	PORTC=0;	
	LATC=0;
	TRISC=0b00000000;

	//???
	ANCON0=0x0F;
	ADCON0=0x00;
	ADCON1=0x30;//0x00;//0x30; //internal Vref +4.1V
	ADCON2=0xBE;//0xBA;//0x02; //
	ADCON0=0x01;

	CVRCON=0;

//????????? USART

	TXSTA1=0b00000100;
	BAUDCON1=0b00000000;
	SPBRG1=12;
	SPBRGH1=0;
	RCSTA1=0b10010000;

//????????? CCP ??????
	CCP1CON=0x0A;//1010 = Compare mode: Generate software interrupt only, ECCP1 pin reverts to I/O state
	CCPTMRS=0; //CCP T/C 1,2
	TMR1H=0;
	TMR1L=0;
	CCPR1H=0xff;
	CCPR1L=0xff;
	T1GCON=0;//0x90;
	T1CON=0x15;//0x15;//0x17;
	CCP1IF=0;

	Servo1FgBuf0=SredPwm;
	Servo2FgBuf0=SredPwm;
	Servo3FgBuf0=SredPwm;
	Servo4FgBuf0=SredPwm;
	Servo5FgBuf0=SredPwm;
	Servo6FgBuf1=SredPwm;

	Servo1FgBuf1=SredPwm;
	Servo2FgBuf1=SredPwm;
	Servo3FgBuf1=SredPwm;
	Servo4FgBuf1=SredPwm;
	Servo5FgBuf1=SredPwm;
	Servo6FgBuf1=SredPwm;

//	PEIE=1;
//	GIE=1;
	GIEL=1;	
	GIEH=1;
}

//=============================
void main(void)
{
	Ini();
	
	for(;;) //?????? ????
	{
		asm("clrwdt");
		ReadADC();
		DataToPWM();
		SendUsart();
		PrepareDataSendUsart();
	}
 
}
//--------********--------*********------***
//=====================
//--------------------------------------------
/*
????????? ?????????? ?????? CCP ????? Compare (??? ??? ??????? 1...2 ??, ?????? 20 ??)
? ?????????? ?????????????? ????????? ???????? 2,5 ??, ?????? ???????? ????????? ??? ??? ????? ?????
??? ?????? ?????????? ?/?1, ??????????? ?? ???? ?????????, ?????????? ?? ???? ?? ?????. ?????. 3 ??? (????? ???? ????????? ?? ????????? ??????????? 24 ???)
?????? T=1/3 = 0.333333333 ??? 
*/
void __interrupt(high_priority) CcpModul(void)
{
static unsigned char StepShim=0;

	if ((CCP1IF)&&(CCP1IE))
	{

		switch (StepShim)
		{
			case 0:
				ccpu.Perev=300;
				CCPR1H=ccpu.P[1];//????????? ?? ????????? ???????????? ????? 100 ???
				CCPR1L=ccpu.P[0];
				if(UsartWdt<30)
				{
				//???????? ??????? ????? ?? USART
					UsartWdt++; //??? ? 20 ?? ???????????
					
				}
				break;
			case 1:
				//?????? ??????? StepShim=1  ????????? ????? 100 ??? ????? StepShim=0;
				LATC0 = 1; //PWM1
				if (FgBuf==0)
				{
					ccpu.Perev=Servo1FgBuf1;
				}
				else
				{
					ccpu.Perev=Servo1FgBuf0;
				}
				ccpu.Perev+=300;			
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			case 2:
				LATC0 = 0;
				ccpu.Perev=7800;
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			//---------------

			case 3:
				LATC1 = 1; //PWM2
				if (FgBuf==0)
				{
					ccpu.Perev=Servo2FgBuf1;
				}
				else
				{
					ccpu.Perev=Servo2FgBuf0;
				}
				ccpu.Perev+=7800;	//
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			case 4:
				LATC1 = 0;
				ccpu.Perev=15300;
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			//---------------

			case 5:
				LATC2 =1; //PWM3
				if (FgBuf==0)				
				{
					ccpu.Perev=Servo3FgBuf1;
				}
				else
				{
					ccpu.Perev=Servo3FgBuf0;
				}
				ccpu.Perev+=15300;	
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			case 6:
				LATC2 =0;
				ccpu.Perev=22800;
				CCPR1H=ccpu.P[1];//0
				CCPR1L=ccpu.P[0];//			
				break;
			//---------------

			case 7:
				LATC3 = 1; //PWM4
				if (FgBuf==0)				
				{
					ccpu.Perev=Servo4FgBuf1;
				}
				else
				{
					ccpu.Perev=Servo4FgBuf0;
				}
				ccpu.Perev+=22800;	
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			case 8:
				LATC3 = 0;
				ccpu.Perev=30300;
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			//---------------

			case 9:
				LATC4 = 1; //PWM5
				if (FgBuf==0)				
				{
					ccpu.Perev=Servo5FgBuf1;
				}
				else
				{
					ccpu.Perev=Servo5FgBuf0;
				}
				ccpu.Perev+=30300;	
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			case 10:
				LATC4 = 0;
				ccpu.Perev=37800;
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			//---------------

			case 11:
				LATC5 = 1; //PWM6
				if (FgBuf==0)				
				{
					ccpu.Perev=Servo6FgBuf1;
				}
				else
				{
					ccpu.Perev=Servo6FgBuf0;
				}
				ccpu.Perev+=37800;	
				CCPR1H=ccpu.P[1];
				CCPR1L=ccpu.P[0];			
				break;
			case 12:
				LATC5 = 0;
				ccpu.Perev=45300;
				CCPR1H=ccpu.P[1];//0x17;
				CCPR1L=ccpu.P[0];//0x70;			
				break;
			//---------------
			case 13:
				ccpu.Perev=50867;//??????????? ?????? ?? ????? ?????? 20 ??
				TMR1H=ccpu.P[1];
				TMR1L=ccpu.P[0]; 


				ccpu.Perev=65535;//????????, ??????? ???????????? ? ??????? ????????? ?/?
				CCPR1H=ccpu.P[1];
				CCPR1L=ccpu.P[0];	
				break;


		}

		if(++StepShim>13)
			StepShim=0;
		CCP1IF=0;
	}
	
}
//=====================
//????????????????? ?????????? ?? ?????? ?????? ?? CAN
void __interrupt(low_priority) CanPriem (void)
{
static unsigned char TempR=0;
	if((TMR0IF==1)&&(TMR0IE==1))
	{
		TMR0L=69;		//interrupt 1 ms
	
		AdcDelay++;
		SendTimeUsart++;
		LedControl();
		TMR0IF=0;
	}
	if((RC1IF==1)&&(RC1IE==1))
	{
	//????????? ?????????? ?? ?????? USART
		ReadUsart();
	}

}

